{"query_id": "763", "query": "Super Rare Surreal Dystopian Masterpiece .\n Very rare movie that is scifi/dystopian/experimental/surreal. It’s like Stalker meets el Topo meets Holy Mountain meets Alphaville meets Delicatessen meets Hard to be a God, like Kurosawa, Tarkovsky, and Lynch had a kid together. It was color, possibly Russian, and I don’t really remember the decade but want to say 60s or 70s, though could easily be more recent. It is VERY rare, there is only one crappy partial print of it, and that is what the youtube version is from. Lot of wide shots in a surreal wilderness, winter settings, strange bleeding saturation in some shots. Crazy costumes. Seriously one of the strangest films I’ve ever seen and my favorite films are strange/weird ones. If you’ve ever seen what you’re thinking of on a “best weird movies” or “you’ve never seen this!” list, that’s NOT it. I don’t think this film even has a cult following of ten people. It’s an actual rare gem. Have been looking through selections at 366 Weird Movies and not found it yet (btw the way most of those titles are exactly the kind of not-actually-rare movies this film is definitely not)."}
{"query_id": "802", "query": "Male little person falls in love with red-headed woman .\n I hope someone can help me track down this movie. I may have some details mixed up, or combined with another drama, so if you have any suggestions at all, please share them. There is a Caucasian man, who is a little person, who is successful in his working life but is lonely in his private life. He may be a writer or editor, or some such professional. I think part of the plot is that he might have trouble making friends because some people are prejudiced against his size. Sometimes he abuses alcohol because of this. He re-connects with a woman he knew when he was a child, even though she used to tease him back when they were children. They become friends and eventually fall in love. She is a regular height woman, also Caucasian, slim and with red hair. In the last scene of the movie, they are dancing on a balcony or rooftop and she is wearing a white dress. Maybe it’s their wedding? I have been through the filmographies of all the male Caucasian little people actors I can think of with no luck. My Googlefu has failed me as well. If you have any ideas at all, no matter how far fetched, please share them. Thank you in advance for any suggestions you may have."}
{"query_id": "950", "query": "Movie about two girls who run away and murder an old couple in bed, have sex on the same bloodied bed. .\n I’m not sure if this is even a movie, a tv show, or if I dreamt it or imagined it. The scene that I most vividly remember is where two teenage/early 20s girls knock on the door of an elderly couple, the couple lets them in and while the couple is asleep, the girls brutally murder them and then proceed to have sex while in the same bloodied bed as the murdered old couple. Another scene is where one girl is in the shower, drinking beer, and the other girl joins her and the have sex in the shower. Another scene which I’m not sure if it’s even part of the movie or not, the girls break in to an old lady’s trailer home and molest her, wear her underwear, and then a cop finds them and kills them. Not sure if that last scene is correct at all. I saw this movie maybe around 1999, it was in color, and it was in English."}
{"query_id": "220", "query": "Possibly an occult film .\n I remember I was yiunger when I saw it, but I don’t remember just how young I was. I remember a woman in labor, arms tied to a bed, legs tied together, and a young woman in a mother room is dreaming of being the child or creature the other woman is birthing. Also remember something about the young woman dreaming about a small creature entering her belly through her belly button? And another scene of the same young woman being laid in or tied to an altar shaped like a cross. Sorry for sketchy details, but it’s driving me a bit nuts…"}
{"query_id": "792", "query": "kid who robs houses .\n Ok, so I seen this movie about 10 or so years ago on cable in america. In this movie, there was a little white boy who would break into people houses/apartments and rob them. He would brag to his friends about the robberies and how he did them. His mother was never around because she was at work all the time. He actually got caught by one couple who was at home during one of his robberies and they threatens to call the cops. At the end, he ended up setting his own apartment on fire and his mom told him they were moving."}
{"query_id": "903", "query": "A man in a hotel .\n I think it’s a famous movie or the actor is famous. There was a man in a hotel and I think he was in a Mafia project as a sudden and unwantedly. I remember two man came to him with a bag. The thing I remember is one day the woman in the cafe(cashier or waitress), he used to eat there everyday, was mad at him why he disregardes her! The man was a silent one as I remember(He had dialogues though) I watched it before 2013 and cause I watched a dubbed version I don’t know the original language."}
{"query_id": "320", "query": "Man gets split in half .\n So my brother was flipping through channels and stopped on this movie with a nude woman, and a man walking toward the woman slowly. When he gets to a certain point, something slices him in half, and the front half I think slides down the glass or whatever it is slowly. I can’t remember if there were voices or not. It was in color, and this scene was dark. Then my bro switched the channel again and this was about 6-7 years ago maybe. I’ve been trying to remember what it is but no luck. Anything is appreciated, like actors or something. Thanks!"}
{"query_id": "731", "query": "sci-fi movie watched on TV mid 80s .\n I was born 1978 as an 8 or 10 year old kid I remembered watching a movie, on tv, involving a scientist or robotics engineer uncovering an evil plot and escaping the lab. On returning home (appartment in an American city late ? early 80s) he tells his ?girlfriend who later tries to kill him. Her arm gets cut off as some point in the escape and reveals she is a robot clone. He eventually fleas to family that live in a rural farm. They have a son and daughter . They all turn out to be humanoids and eventually try to kill him. One scene is of the boy robot driving a front end loader and is about to kill the man (strong lead actor) but tbe loader hits the light and the robot is electricuted. That is all I can remember. Thanks"}
{"query_id": "882", "query": "comedy about two adventures and a villain .\n It was a light comedy from the 80s or 90s. I just remember the start of the movie. It was a scene with two adventures in a scene like indiana jones, trapped, captured by enemy forces. The main villain was approaching them and one commented to the other: “And now he comes and says something very cliche like ‘gentlemen, we meet again’, wanna see?”  So the villain really says that, and they find it funny."}
{"query_id": "293", "query": "Date Movie from awhile ago .\n This was a movie from at least 10 years ago.  The lead actor and actress are on a first date and eating at a burger stand or shop of some sort and the guy mentions how hard dates are because the guy worries the whole time about whether he will get a kiss or not.  So the female says lets just kiss now and get it out of the way. I dont recall how long ago it was, any of the actors or what else happened in the movie.  i think it was a romantic comedy of sorts."}
{"query_id": "525", "query": "Arthouse/Indie film  about a couple of 5 years .\n Saw the trailer at a local theater some time ago: the main characters are a couple (with a cat i think?) and they are experiencing relationship  problems and kind of a dullness in their live. The woman looked like Annie Clark .                                  The couple kept repeating that they were already 5 years together and at one point the woman told an older woman about it in a dialogue with a meaning like this (roughly): Woman: I don’t understand, we’re already 5 years together, I mean we’re not at the beginning anymore. Older woman: 5 years is just the beginning.  "}
{"query_id": "155", "query": "Old Kid Adventure Movie .\n See ~35 years ago All I remember is a giant metal robot guarding a hill.  Somehow the group was able to get past the robot and into a cave behind or underneath the machine.  The group spoke to the machines keeper and then noticed an entrance to another chamber behind a pile of junk. (The chambers door was blocked by junk).  Past the door was a large cave where the group found a white flower growing on a small hill in the center of the cave. That’s all I remember."}
{"query_id": "1014", "query": "Asian (Possibly Hong Kong) Crime Thriller from the 80’s or 90’s .\n I’m searching for the name of a possibly Hong Kong Crime/Thriller from the 80’s or 90’s. The scene that I remember is A woman is coming downstairs at a hospital while a nurse carrying medicine/needle on a tray is walking upstairs. She follows the nurse, handgags the nurse and drags her into the very first room on that floor. In a few seconds, the woman comes out of the hospital room wearing the nurse’s clothes and hospital facial mask. (Probably carrying the tray too) The next scene shows nurse is tied up with virtually no clothes on and gagged. She struggled aggressively. The next scene shows some men in suits standing in the hallway outside a hospital room. I think the woman in disguised is trying to get inside to kill the hospitalized person. Anyone has any idea what movie this is?"}
{"query_id": "784", "query": "Please help me find this movie’s name. .\n I didn’t see this movie. I just saw a scene. So i don’t recognize any character. I think it’s a an english movie nearly 2000’s. The scene is two men in a car was waiting for a girl. It was night. Seeing that girl they started to follow her. Then they wore mask. When the girl realized that she was being followed she started to run and escape. But before she could do that they caught her. Then one of the men beats her and then rapes her. And other man was holding a gun. Before raping the girl the man removes his mask. When the girl was screaming there was a train going over a bridge above them. When they were leaving the girl the other man who was holding the gun said,” Hey man, she saw your face.” The man who raped the girl said,” I know, let her go.” Can anyone guess which movie is this. I really wanna see what happens next. And sorry for my english. Plz help…"}
{"query_id": "115", "query": "Bizarre Netflix Movie About An Inn? .\n Netflix within three years ago. Colour. English. Cinematography suggests somewhere around the 90s. I saw a movie a while back and I can’t find it again. It was weird and dark, very Tim Burtony. It’s an inn or boardinghouse by the sea. The residents ate crappy food and that’s what kept them ill. They started eating better food and started getting better. There was a bit about a boat at the end of the pier, but I can’t remember. I think that’s how people got off the island that the inn was on?"}
{"query_id": "204", "query": "Teen romance .\n I think I saw it around 2006 on one of the movie channels on sky, (i think it was 306). Okay so the boy and girl are teens and all that I can remember is that the boy in the film has feelings for the girl and think they’ve been friends for a long time and she’s kinda moving on and stuff and somehow she finds out he likes her as more than a friend. There’s three scenes I can remember briefly, okay so the first one, the boy imagines this other boy riding into or he imagines himself diverting the boy into a large dumpster or a skip, okay the first one either happens like that or the boy imagined himself beating up the boy into the dumpster. Okay the second scene the boy and girl are karate practice and again the boy imagines a different result, I think he might have imagined himself showing off or something. Okay this one I know for sure, the boy and girl went through like a fight and he turns up at the girls family event and they don’t say anything they just slowly dance and thats the end, the girl had blonde hair and was wearing purple I think.  I remember the title being odd like it had number in or the letter q in  I know this pretty broad and could describe a lot of films. I’ve just been trying to find this film for soo long and would appreciate any help."}
{"query_id": "1015", "query": "90s Hillbilly Comedy Movie .\n Ok so all i can remember from this movie is… Its like a group or a family who end up at this strange haunted raggedy looking house an I remember it had alot of cars parked in the front and the family that lives there are a bunch of weirdos. There is one baled old man who walks with a cane and i believe they run an inn or have rooms that the group of people rent. The family looks like a bunch of hillbillies and they taunt the people that rent a room. I believe it is a twisted comedy I know this isnt much help but i just cant remember anything specifically. ALSO it has a well know actor in it."}
{"query_id": "758", "query": "Old thriller movie .\n There’s a young woman standing in a shop, looks like an antique or curio store, and she is staring out the window. I believe she had dark hair, but it’s black and white, so it might have been hard to tell. I think there was another woman with her to the right on screen, who ran the shop. The camera cuts to the window, where outside some little girls are jumping rope and chanting a nursery rhyme. They might be blond. I think there are two of them. It cuts back to the woman looking out the window, who says “Those kids-” and looks horrified or scared. The kids had a creepy vibe, like children in a horror movie. I guess there was some significance to them. That’s all I remember, so the woman may have finished her sentence and I forgot it. For a while I was convinced that it was from the old Twilight Zone episodes from the sixties, but I watched all the ones I have and haven’t seen anything like that. I also keep searching on the Internet about this show and girls jumping rope, but nothing helpful comes up. I saw it a long time ago when I was a kid, maybe ten years ago, so my memory is fuzzy. There’s the gist of it; I may have gotten some details wrong. Thanks so much if you can help!"}
{"query_id": "880", "query": "Black and white movie were angels come from heaven using an elevator in a hotel .\n All I remember is that people stand in the lobby of the hotel and wait for the elevator for a long time and they are all pissed off, and there is a dial that shows which floor the elevator is on which keeps going up and down. I do not remember what reason the angels have to come down."}
{"query_id": "838", "query": "70-90s comedy Young guy meets a lady at a cafe, the attempts of making the date are the storyline .\n He meets this girl in a café basically, and he ends up going over to her place later. She has a roomate that is doing paper mache stuff. Rest may or may not be in order: There´s this gag throughout the movie about two guys in a van stealing stuff, among those the paper mache thing, and the main character calls them out for it but we learn those were friends of the roommate. I´m fairly sure the girl(might´ve been the roomate) dies at some point or in the midst of the movie. There´s a note that one of them have gone to a “hard rock” bar or disco, and the main character goes there, and in the party, some guys pin him down and attempt/or succesfully shave his head. Rest I can´t really recall, thanks in advance!"}
{"query_id": "246", "query": "Charles Bronson Clone? .\n 1950s B/W about the suburbs. Several neighbor families in a new suburb.  The families are all white but from different socioeconomic classes, professionals, tradesmen, white-collar workers all living in harmony. Not all of them have children. One of the men, played by someone who looks a bit like Charles Bronson, is angry. The plot hinges on this. The conflict ends as he is on his carport working under his car when the jack slips and he is crushed under the wheel. His wife and kid presumably move away, much happier now that their angry husband/father is gone, but also with trepidation because in spite of it all, they loved him and he was the breadwinner."}
{"query_id": "909", "query": "Movie from the 80’s (I think). It was a murder mystery .\n I saw this movie when I was fairly young. All I remember is the older cousin ends up stabbed to death in an alley and at the end it’s revealed that the younger cousin sees the older cousin kissing someone so the young cousin stabs the older cousin to death. This has been driving me crazy for years. The ending disturbed me so much that here I am 30 years later still thinking about it."}
{"query_id": "942", "query": "Which movie? Help@@@@@ .\n There is a movie where the actor suffers some kind of transformation or surgery idk and everybody thinks he lost his memories and his feelings. There was a scene where he was at home with his wife and he was poiting his finger to his nose in order to say to his wife ”I love u”. The wife knows that this thing is just between them and after the surgery or transformation she knows that he s still in there."}
{"query_id": "588", "query": "Early 2000’s film ifc maybe .\n Hi I remember a movie it had to be an ifc film i seen about 4 years ago It was a little girl and her father in a big house in the desert or Texas the little girl was in a dirty white dress most of the movie and I think she played in a train car box and her father kept saying he was going scuba diving when he would “shoot heroin” do drugs and I think they had the dead body of her mother or grandmother in the house…..strange film that me and the other person remember watching but can’t figure out what it was.please help!!!"}
{"query_id": "520", "query": "i can’t be too precise .\n like i only remember bits and pieces, but what i know is there was this lil virgin girl who is home alone for some reason, she starts being a man who lives next door, he’s in the army reserves  and thats all i can piece together"}
{"query_id": "484", "query": "American Comedy Movie (1990-2014) .\n An American comedy movie. Main character is a famous person like a celebrity. For some reason in the movie, he needs a place to stay for one night. He comes across a married couple (he never met before) and asks them if he can take shelter at their home. The husband recognises him and is actually a big fan his, so he lets him stay. Some time later, the husband leaves the house to grab something. And when he comes back, he catches his wife seducing the celebrity. Eventually they have sex. Surprisingly, the husband is excited and overwhelmed that his idol is having sex with his wife. So he happily watches his wife cheat with the celebrity. Overall it’s a very funny and comedic scene."}
{"query_id": "119", "query": "Astronauts/Sci-Fi Movie w/Planet that has different surrface time to that of it’s orbit .\n From what I remember it involved 3-4 astronauts.  One stays in orbit (a black man), while the others go to the surface of this planet. The ones on the surface are there to retrieve data (from probes perhaps?). The astronauts on the surface only have a limited time to collect this data and get back to the ship in orbit.  I think something happens to shorten their time there (a storm maybe?).  During this scene they were surrounded by water if I remember correctly. The female (possibly the crew leader?) keeps saying she can finish the data collection in time because it’ll be ages before they can get another chance.  She says this despite the warnings from her comrades to just leave.  Well, they miss their chance to get back to the ship in orbit. Now the kicker is that the time on the planet’s surface is vastly different to the time in orbit.  For instance, on the surface perhaps only a few hours pass, but in orbit several years pass.  I think it ends up being something like 20+ years to the man in orbit before the surface crew gets back. Anyone know what this movie is?  I watched it in the last 3 years, but I streamed it so the movie itself could be older.  Although I don’t think it would be more then say ten years old.  It’s in colour, an American film in English."}
{"query_id": "439", "query": "The Two (girls name here) .\n This is a foreign subtitled film I saw in the 80’s, I believe on PBS. All I can remember is a girl or two girls living parallel lives in the city. It’s been a long time, I’d like to see it again. Thanks, for your help."}
{"query_id": "631", "query": "a animation where a woman tries to jump through a passage and loses her legs .\n When I was around 8 years old I used to watch a lot of anime and cartoons. And I recall a scene, I don’t know if it is a movie or an animation with episodes. I just recall this one scene: It is a futuristic place. But looks like a ruined society style, with dirty builds and some technology left. And there is this woman who needs to jump through this passageway to reach where she needs to get. And one day, she tries to jump through it, but fails, and a machine, built within the passageway grabs here with robotic arms and cuts her legs of. So she will never make the jump again."}
{"query_id": "437", "query": "70s movie with a guy and a bus and a gypsy’s daughter .\n I watched this movie in 1982 or earlier as a kid. It may have been a 70s movie. It was a movie in English, in colour. This is what I remember: There was a young guy, driving a (doubledecker?) bus or some sort of caravan. He may have been in a foreign country, in the countryside. He meets a pretty girl and wanted to ask her directions (I think). She doesn’t speak English, and she thought that the guy wants to marry her. So she happily brings him back to her village and introduces him to her father. They are gypsies or something like that. I don’t know if it’s a musical but I know there’s some singing in the movie. Can anyone help me? It’s been bugging me for years! Thanks in advance!"}
{"query_id": "742", "query": "movie with high tech strength enhancing backpack .\n All I remember is that within the movie they created some backpack like device that makes people stronger and faster with an effect of the persons voice sounding different while using it. Scene wise, I remember one where the “bad guys” are controlling the main character’s(a teenager I think) dad by having him where one of the backpack devices while the person controlling him has some kind of special outfit on so that whatever the controller does the father is forced to mimic. Also, I remember a scene where the main character is on his bicycle on the interstate while wearing one of the backpack devices and he uses it to petal so that he is going like 70mph or something. I would have seen it somewhere between 5-15 years ago though I have no idea how old it was at the time I saw it."}
{"query_id": "1048", "query": "Movie based on a Singer .\n I remember this movie based off a singer who keeps seeing a dead lady named Meg Ryan who was a singer also, there’s a part in it where she took a picture with the lady when she got the picture and looked on it, it was her alone in it"}
{"query_id": "699", "query": "Ramblin Boy .\n Set in England/Ireland.  Older musician returns from South Africa for funeral childhood friend.  Collection of memories (small band, affair with older woman, home on the shore, child killed by bomb, costumed dance with girlfriend, girlfriend as adult crying on her farm)"}
{"query_id": "635", "query": "Skeletons walking underwater .\n I have this vague recollection of a movie that I saw in the early 80s with this scene of a bunch of skeletons walking on the bottom of the ocean toward land. It was a fairly long scene, and it scared the crap out of me as a kid. I cannot for the life of me remember anything else about the movie or what it is called."}
{"query_id": "680", "query": "Help! .\n Besides a plot or scene description, consider adding the following information to help people identify your mystery movie: I don’t really remember watching this, it randomly popped into my memory, but I feel like it was in the last year or two. There wasn’t any talking at all and it was in color. It had to have been newer because it wasn’t grainy. It wasn’t a full length movie, maybe just a short film or the opening to a different film? There’s a naked cave woman and she gets separated from people she knows. I don’t remember if it’s just one person or multiple or how they were separated. She’s pregnant and gives birth to a baby alone. She spends time wandering and starving unable to feed her child. She ends up finding and eating a like raw egg(s?) so she can breastfeed it. While she’s climbing the a tree she hides her baby in brush. Something comes and I think tries to eat the baby but she tries to fight it. I feel like by the end she’s dead?"}
{"query_id": "734", "query": "a film like sexy thriller .\n There was this movie in the starting of it a girl pays homage to his deceased mother in a crocodile lake her mother is not dead which we found in the end and herher father also . A bitchy girl from her college claims that she is the girls step sister from her father. And it provrd truth. The girl star recriving only 25000 dollars a year.actually ir was their planplan . I dont remember the movie name .in the end the girl with her mothermother throw the father out of a plane or helicopter  "}
{"query_id": "727", "query": "Boy, wizard, wolf, little pink guy? .\n I remember a cartoon movie about a boy who’s town and mother got captured by colorful hyenas that go by a specific name. He had to go on this long journey to find a wizard who could defeat the hyenas, and along the way he met a wolf who turns into a human, a little pink bunny-like creature, and a guy with a mosquito living on his shoulder.  The bunny guy comes upon  a tribe of Indian guys who worship him because he looks like their god. They eventually found the wizard, but before they met him/her the mosquito guy said that wizards are old guys with long beards. They meet the wizard who turns out to be a little girl. They ask her to defeat the hyenas, and she gives him a mirror. He realizes that he has the power inside him to defeat the hyenas. He releases his whole town and his mother and they all live. That’s all that I remember. This will bug me until I remember."}
{"query_id": "910", "query": "Scary Movie Watched on TV (2000s) .\n So I’m having a hard time remembering this movie or if it even actually existed since I’m the only one who seems to vaguely remember it. It aired on TV sometime between 2008-2011 because I remember it well enough to have scared the living crap out of young me. I think it was on nickelodeon, Disney channel, or cartoon network because those were the only channels we had at the time, but I can’t find anything. I remember a town being haunted by something and people were going missing, so these kids figured out what was happening and it turned out there were these alien-like creatures who were stealing people and wrapping them in a cocoon made out of goo. I think it like, slowly ate away at the person but I can’t remember. I can vaguely remember a scene where they’re crawling through some type of piping system underground to find the creatures nest and they had to be super quiet, but the creaturest eventually noticed and took one of the kids, a boy a believe. The creatures were gooey with sharp teeth if I remember right too. Sorry for the really long post, but this is going to bug me forever if I can’t find this movie!!!!!!"}
{"query_id": "354", "query": "70s sci-fi / horror movie with stalked creatures .\n I remember seeing a movie on TV (in the US, in English, in color) in the 70s or possibly early 80s. iirc it took place on Earth and there was an invasion of creatures that looked like flat, stingray-like things that moved slowly across the ground without any visible legs (kind of like flattened slugs). Each creature  had a single vertical stalk/appendage that it used to “look” around. The creatures didn’t have any eyes or discernible features and they were very alien looking. I don’t remember much else about it but it made an impression on me as a kid. I’m not sure if it was made for TV. Thanks!"}
{"query_id": "1060", "query": "Group of teens try to escape dystopia and find island with freedom .\n I believe this is a kids movie I saw on TV in the mid to late nineties. It was in color, in English, and may have been on one of the kids channels. The main characters are a sister and her younger brother, a family friend who is like a big silent bouncer or bodyguard, and a young suave guy they meet. It’s an adventure-fantasy in some sort of future dystopia. I remember a couple of scenes… Suave guy sees the sister fight off some military types and invites her to escape with him through a security checkpoint in the desert by racing their flying boards past the guards. They succeed in escaping, and are later joined by the brother and bodyguard dude, much to the chagrin of suave guy, who thought he was ditching the weaker elements. Sister says she would never leave them, they’re her family. Later, the sister gets captured and taken to some sort of facility where she gets strapped to a gurney. She gets out of the straps by shimmying the gurney until the bottom release button is hit, then stretches her legs over her head to hit the top button. She wanders around the facility, running into the brother of a friend that is so doped up he doesn’t even know who he is. She is recaptured, and suave guy and co. break in to save her. The group have almost made it to safety when their way is blocked and bodyguard dude has to sacrifice himself to ensure their escape. The final scene shows the kids running around a beach playing and enjoying their new-found freedom while suave guy does a voiceover. It’s crazy the things we remember and the things we don’t… But if anyone can tell me what this movie is I’d be eternally grateful!!"}
{"query_id": "584", "query": "Kidnapped kids, lecherous twin henchmen, a luchador villian, and goo-pods?? .\n When we were a few years old, my twin sister and I sat down and watched the strangest movie with our parents, and I haven’t been able to find it since… It starts out with a boy who gets kidnapped by these two homely-looking twin henchmen, who take him back to a sort of children’s colony/prison island. (I believe they took some sort of boat, possibly through a swamp to get there… My memory is a bit foggy…) When they arrive, they are greeted by this tough, ruthless villian-character, who forces them into doing chores or some sort of labor for him. (I remember I thought that he looked a like a Mexican luchador, but I could be wrong.) Any child that wouldn’t do so was immediately sedated and plunged into a comatose state inside what seemed to be a pod of goo. Ultimately the movie ends in all the children escaping and the boy waking up in a meat locker/basement/whatever to discover it had all been a bad dream. I remember there was also some sort of musical number… Something like an ode to the main villian (one of the henchmen had some sort of infatuation with him, idk) that went, “He’s so b-b-beautiful to me”. I know I’m not insane for remembering this because my sister remembers the same exact thing. I would guess it could be a movie from the 90s/early 2000s, at least before the year 2004. Does anyone have a to what this could be?"}
{"query_id": "597", "query": "Horror movie 80s maybe 70s .\n I saw this move in the early 90s but it looked older, most likely 80s but maybe 70s. The movie is developed in a funerary house, or at least part of it, on the ground level the house is like a regular funerary house with a small chapel-like room, and the basement is where the bodies are “prepared” for the funeral. The “bad guy” is a tall pale man who wears a suit, and I’m pretty sure he wears a hat too. On the last scene, the bad guy, who apparently survived to the usual horror movie drama is seen walking on the funerary house hallway until he reaches a body on an open coffin, he then grabs a syringe and pinch the body extracting (or maybe introducing) some sort of white-yellow-ish translucent liquid to the dead body. We can then see that after removing the syringe from the body, the bad guy licks a drop of the liquid that was dripping from the needle of the syringe. I cant remember well, but I’m pretty sure that the liquid played an important role in the movie."}
{"query_id": "971", "query": "Decrepit Mansion love story movie .\n I’m trying to figure out the ne of aovie I saw, I have no idea where  it was made but I feel like it was at lest semi-recent. Anyways what I member is this. This old lady lives in this amazing old mansion, but it’s like in serious disrepair, and she doesn’t seem to notice like she’s living in the past. Anyways she’s raising her niece, and there’s this lil boy who like hangs around because he’s a gardener or something and him and the niece end up falling in love. The niece paints, and the aunt smokes a lot and sheakes the two of the dance together in the ballroom. She warns the boy that the girl will break his heart. And she moves away and he still visits the old lady sometimes… that’s all I know. I could swear the girl is played by cate blanchet but I don’t see any films in her filmography that seem to match! Please help!!!"}
{"query_id": "567", "query": "70s/80s Fantasy movie with a huge monster in a red cave .\n Hi, new to this site, but a memory of a movie I saw in ~1986-1988 when I was 3 or four years is still bugging me.  My only recollection of this movie that it was a high fantasy, sword & sorcery type movie that was on network television (I didn’t have cable) during daylight hours.  All I remember is a man in a dark red cavern with a sword talking to what looked like a very large dragon or monster which made either a deep booming sound or actually talked to him.  The monster appeared to be several stories tall, and the scene took place toward the very end of the movie, because i remember it ended soon after.  I believe it was the climax of the movie.  I know it is not the movie “Legend”, but it may be similar to that. Thanks for your help, this has been bothering me for 25+ years."}
{"query_id": "347", "query": "Dramatic horse movie .\n I remember seeing a movie some time in the 90’s – I think it was from early 90’s maybe later 80’s. It was in color, English, probably made for tv… A high  school age girl starts hanging with the wrong crowd and gets in some trouble. Her parents send her to a horse farm to work there hoping it’ll change her attitude. I think there are other wayward teens there as well. The farm is run by a woman who is, I think, a single mother. She acts as a mentor to the girl. At first, the girl resists, but eventually lightens up and starts to do well at the farm. She bonds with a horse and she’s happy and all is well. Then tragedy strikes. She gets into an accident (I want to say she falls off the horse) and she winds up in a coma in the hospital. Eventually she comes out of it, but she’s paralyzed. They bring her to the farm to see the horse in a wheelchair, but she’s mad and she blames the horse. In the end she magically gets up and walks again, forgives the horse, and is normal again. I think it was a pretty cheesy movie, but I was just thinking about it and wondered if anyone knew what it was. I did a google search, but I couldn’t find it. I remember the dad being someone that was kind of well known. Thanks, Shawn"}
{"query_id": "397", "query": "I’m stumped .\n This might be totally unhelpful description but here goes: english film It involves 2 teenagers (1 boy, 1 girl) who I believe worked at some sort of waterpark/ or theme park (maybe lifeguards??) They are or become friends and a lot of the movie involves these 2 characters and the girl’s younger sister, whom I believe does kiss the boy at some point. i would hazard between 2000-2010 sorry for the vagueness but any guesses at a name would be gladly appriciated. Thanks."}
{"query_id": "199", "query": "Late 70s or 80s cross between Surviving the Game and Gymkata. I saw it on TV as a kid and… .\n Late 70s or 80s cross between Surviving the Game and Gymkata. I saw it on TV as a kid and remember the hunters all wore masks and had to choose different weapons and the main guy ended up hunting the bad guys at the end. I want to remember more but may confuse it with other movies. But the bad guys wear masks to hide their identity and I remember a fight scene in a swampy area and the final scene is at a house that seemed to be on stilts with a lot of glass and I think the bad guy was trying to get away by helicopter. It was definately a “Let’s hunt humans for fun” type movie."}
{"query_id": "135", "query": "Movie based on true story .\n OK. So I think I saw this movie on lifetime. It’s from the 2000/2015. All I remember is a wealthy business man marrying a young realeaste woman. Then for some business reason he travels a lot to England. They are building a beautiful big mansion and the wife gets in a relationship with one of the construction guy and tries to kill her husband. Can’t remember if they actually do kill him or not. Also I remember her being really upset about someone ruining all her flowers outside the mansion. I think they had 2 kids..And I think it was actually based on a true story Help!!!"}
{"query_id": "705", "query": "wierd film from FLIX in the 90’s .\n I don’t think this film was ever in the box office, but it could have been an indie film. It was aired on FLIX in March of 1997. Here goes. This gay guy is in a prison cell with this big guy with a Spanish accent. The gay guy is reiminsing about meeting some guy he had a crush on. The gay guy remembers meeting the guy in a restaurant. He was the gay guys’ waiter. I remember the gay guy saying, “That sad smile; that white shirt.” He and the waiter became friends. The waiter was married with children. At a later point, the Spanish guy got a bad of diareah and the gay guy helped him. Does anyone remember this?"}
{"query_id": "147", "query": "70s or 80s western thriller .\n Watched part of a late night movie about early 80s.group of cowboys ride into a wooded valley and come across a wrecked wagon.they stay the night and find strange markings on their horses in the morning as though they are being watched.then I fell asleep. Anyone give me a title? Thanks"}
{"query_id": "235", "query": "Kids sucked into a computer .\n This is a family sci fi movie from the late 80’s or early 90’s. A small group of teenagers get sucked into a computer/video game. I believe that the game was set in prehistoric times and had humanoid dinosours. I mainly remember a scene where the villain was holding one or more of the heroes over a lava or fire pit. At the end the kids escape and the game has returned to normal. Not sure of much else but the film couldn’t have been any newer then around 97."}
{"query_id": "576", "query": "Excalibur-type movie about two sisters – one evil and jealous with dark hair .\n I watched this on tv sometime in the nineties. It was in English and in color. I was very young so I only remember two scenes: – montage of the two sisters growing up. They’re always in competition. They each bake a cake and when the good sister’s cake comes out perfectly, the evil sister casts magic to make it flop. – the good sister is grown up and walking through the desert. She encounters an African woman with a water flask who offers her a single drop of water. She lets it fall onto her tongue. It’s one of those movies with knights and kings and women in long dresses. Maybe with a dragon somewhere even? It definitely featured magic. Please help it’s driving me crazy!"}
{"query_id": "440", "query": "Classic movie in which people meet in a bar after 20 years .\n Hi. I saw this movie many years ago in TV. It was a classic one, maybe 50s or 60s at most. It was about 3 or 4 people, maybe sailors, who are splitting after ending their service, and are in a bar. They somehow decide to meet again 20 or 25 years later, and write a letter to themselves they put somewhere in the bar. Then the movie jumps to years later, when they actually get back, each one expecting to be the only one to show up for the meeting, and tell themselves of their lives. Anyone remembers it?"}
{"query_id": "551", "query": "1960s newyorker versus rednecks .\n The film begins with rednecks in a truck towing another redneck on a board down a slope. The towed man crashed into a barbed wire fence. A city-dweller with his wife on holiday is harassed by them. He defeats the ring leader with a karate blow.  I forget the rest."}
{"query_id": "418", "query": "Can someone tell me the title of this movie? .\n So basically it’s a horror movie i watched in 2009 but can’t seem to remember the title and i’m not sure the movie was released in 2009 or earlier The plot: The movie follows 2 college students – a boy and a girl(the boy seemingly had a crush on the girl) who take the car to drive to somewhere but have an accident on the way and crash in a unknown haunted place. The place is all snowy and full of scary and paranormal activities occurring and they have to find a way to get out. Each time they carry out a plan and if it fails they run back to the car as quick as they can. The girl also starts having feelings for the boy over time and they kiss at around halfway through the movie only for the girl to discover that the boy had been urinating blood all this time(because of kidney damage following the accident)but he didn’t say anything. So at the end the paranormal activities get even more violent and the boy dies but the girl is able to get out of there and is found by the police. Please can someone tell me the name of this movie? Anybody relate to it or have watched it?"}
{"query_id": "949", "query": "Foreign movie like cj7 .\n So it’s a foreign movie like cj7. There’s also this alien or creature a kid finds and it kinda grants wishes or something. One time the kid had swimming practice and the creature hopped on his back and made him really fast.   There’s another part I remember but idk if this is from cj7 or the movie I’m talking about. The kid asks for answers to the test so the creature gets the answers from another student but the name was also transferred so the teacher didnt accept it.   My description is so short. I watched with waaay back so I don’t remember much."}
{"query_id": "326", "query": "guy constantly wears a knit hat and girl is contemplating selling her eggs .\n Hi everyone, I would really appreciate it if you could help me find this movie. I saw it on TV a couple of years ago, can’t be more then ten years ago. It was in color and it ended with written text about what happened to the people after the movie ended like they often do in movies about actual events. Here’s what I remember: There’s a young guy who constantly wears an odd knit hat. He meets a girl. She asked him why he always wears that hat and he says it is because a lot of your body heat is lost through the top of your head. She asked if he needs to wear especially this hat, he says no and they exchange his hat at the lost and found. During the movie, the girl keeps contemplating selling her eggs because she needs the money, at the end of the movie she doesn’t have to sell her eggs after all for some reason. I hope someone out there knows just what movie I’m talking about. Thanks for thinking along."}
{"query_id": "337", "query": "british crime film, late 1950’s or early 1960’s .\n I would like to find out the name of a film I saw years ago. It was one of those late 1950’s or early 1960’s British crime films. It was in black and white. One of the early scenes is the ringleader sends out half a banknote to a handful of criminals with a letter telling them that they can get the other half of the banknote if they meet up at a rendezvous. The plan is to then either to retrieve some previously hidden cash stash or do another robbery….I can’t quite remember the plot. Possibly Jack Warner? Any help appreciated Thanks Dave"}
{"query_id": "818", "query": "Old Dog movie from the 80’s or 90’s .\n What’s the name of this dog movie that’s very similar to homeward bound? The movie’s about a widow who lives alone with her dog. The woman’s son wants her to live with him and his family but she refuses to do so. One day the dog somehow escapes and gets lost,he later gets picked up by a truck driver. The truck driver looks at the dog’s tag but throws away his collar deciding to keep the dog to himself. He then goes in a diner and leaves the dog outside, which is when he runs away and tries to make his way back home. On his journey he lives with another family with two kids for a little while and helps them set free some stray dogs that had been captured and were living in cages. Later he and another dog find a girl who lives with her grandfather and can’t walk, so they stay with her until Christmas season is over, the girl gives a cross necklace to the female dog before they leave her. The female dog gets ran over by a car and a traveler buries her and accompanies the pooch for a little while before parting ways. In the end the dog manages to get back to his original owner just as she’s about to move away with her son."}
{"query_id": "1021", "query": "Thriller movie- Trying to find it for years. .\n There was this movie I saw on television about 5 years ago. It was in colour and in English. It was a late 80s or 90s movie. It was a thriller movie and I remember a scene that takes place in an underground parking lot. The scene which I remember is this- the main character is inside a parking lot and there is an SUV which is trying to kill him. The driver of the SUV is in relentless pursuit of the main character. As far as I can remember, the main character was a young man and the killer is a middle aged man and there may or may not be another injured man there. There’s no one else in the parking lot."}
{"query_id": "187", "query": "stuck in maze .\n Ok so this was a weird movie I picked out when I was a kid in Blockbuster. It was on VHS and I watched it in the 90s but it could have been made in the late 80s. All I remember is it was either one or two guys kind of stoner like getting stuck in a white maze. I can’t remember if the whole movie is about them getting out of the maze. The parts I remember are there was like an Easter Bunny, a weird grandma, and a grim reaper. My description sounds like I’m getting ready to tell a joke but that’s what I remember about the movie."}
{"query_id": "589", "query": "Recent foreign film about odd ‘man/creature’ who moves into a family’s home .\n I have only seen the trailer for this movie, so I can’t really summarize the whole plot. The movie is in German, I think, but it could also be Dutch or Flemish. A strange/looking man moves into the home of a family and he proceeds to dominate the family’s life. The man looks like a homeless person, with a long beard, he is very dirty and wearing hardly any clothes if I remember correctly. He doesn’t speak. In one scene I think he is taking a bath in the family’s tub. From what I remember of the trailer the man is not really a man but some sort of mythical creature, but having not seen the film itself, I cannot be sure.  I think the title is a single (odd) word, but I could be wrong. I think it came out within the last five years, but it could be a few years older than that. Please help me remember what movie it is!"}
{"query_id": "747", "query": "Old B&W Horror Film .\n I saw this movie a few years ago around Halloween. I believe it might have been made in the 50’s or 60’s. A group of people are in a house.  They were talking about how vengeful and cruel (I forget if it’s uncle or father) was.  Also they were talking about their fears and how each one was suppose to die.  I believe the killer also wore a costume hinting it was the Uncle or Father. I remember one scene(slight spoiler) where their was a decapitated head on a silver tray.  I don’t want to say too much more. Any help would be great"}
{"query_id": "322", "query": "Blue paint messing up the Mona lisa scene. I THINK it was made between 1990’s-2000ish .\n All I can remember from this movie (could of been a TV movie) is that there is a guy was tryin to fix a spot on the Mona Lisa Painting with blue paint and ends up covering the whole picture with it and is freaking out. He covers the painting in a cart with some cloth as hes moving down a hallway very nervous. If anyone has any suggestions I would be very much obliged. This has been driving me nuts for about 5-7 yrs now."}
{"query_id": "937", "query": "60s-70s era “Hippy Sci-Fi” weapon turns hippy dirtbag into an alien .\n Here is one I saw long ago >> 20 years on TV, probably a “Creature Double Feature”.  Hippy dirtbag guy finds this alien weapon.  He puts his arm into it and has a good time blasting stuff with the laser pulse.  It may have impregnated his palm with some sort of thing (maybe a gem or a scab).  Eventually he loses his humanity to the weapon and he becomes an alien (after he finds that he can no longer remove his arm).  I remember him blasting stuff like telephone poles maybe.  Gun looked like a tube that you stuck your forearm into…poor bastard."}
{"query_id": "335", "query": "an old movie with a scene of putting a man in metal cage then in fire .\n An old movie seen during 1990s on TV. I think it was in english and in color . The airplane of a family fall in a strange area. there is a scene of introducing disgusting food; eyes in soup. And a scene of putting a man in metal cage then in fire."}
{"query_id": "408", "query": "Opening scene with girl in a hoodie .\n This has been bugging the heck out me. It’s a horror movie I believe. It starts out in black and white (more of a grayish tone) at a small restaurant. A girl walks in with a red hoodie on (the hoodie may be the only thing in color, maybe not). Everyone in the restaurant seems to recognize her when she walks in. Her face is badly disfigured. People seem to be uncomfortable with her being in the room while they’re trying to eat their meals. The people in the restaurant also seem to stare at her and whisper about her till a she gets to a point she can’t stand anymore. She stands up and yells something out like “Is this what you want” and takes off her hoodie to show her disfigured face, then the opening credits start to roll. This is how I think the opening starts. I’ve looked through my movie selections for months to try and find it, with no luck. I had a head injury a few years ago so sometimes I don’t put information back together correctly. I hope I can an answer here. Thanks in advance for any help."}
{"query_id": "925", "query": "Suicide/murder/strange support group in a hotel, constant party in the hallway movie???? .\n I thought I already submitted this but I don’t see it so, forgive me if it’s a duplicate. I saw a movie in July or August 2014, I believe on FOX TV network in the U.S. It was a recent movie, I’d say from the last few years but could be as old as 2000. It was in color and in English and I’m assuming it is American made. For some reason, I swear Kirsten Dunst was in this movie and keep thinking it has something to do with The Virgin Suicides but it is not that movie and I can not find it when searching Kirsten Dunst. The majority of the movie takes place in a hotel or dormitory type building where the doors are numbered. There appears to be a constant party going on in the hallway. In one room, there is some sort of support group where young people gather and I’ve young man reads from a journal if some sort. This scene reoccurs multiple times with fewer and fewer people attending I assume because they were either murdered it committed suicide. In another room, there is a young couple. The male  us in a band. The female is a blonde actress that I thought was Kirsten Dunst but was a female actress I recognized, possibly a Disney actress? They are plotting murder in that room and the girl seems to be trying to leave her family. In another room, there is a girl sitting, hugging her knees. The room is all white. Mental institution? A woman comes in and appears to try to entice her into committing suicide. The theme of the entire movie seems to be that these people are all connected in that they try to convince others to either commit murder or suicide. Another young male is in his room at home, apparently watching deaths online but he can not leave his house. A murder us committed on the streets, by one if the young males. At the end, the male who read from the journal is in the support group room and the male who was in a band comes in and murders him. I believe that us how it ended. It was a very confusing movie as I didn’t see the beginning. I keep wondering if it was a dream but my dreams do not usually follow such patterns. Any help offered will be greatly appreciated. Thank you!"}
{"query_id": "489", "query": "Won lottery .\n I saw this movie in about 2000 year. It was comedy movie. A woman who wore red coat and shoes moved in an apartment for rent. A old man won lottery who lives in it. But his neighbours intend to get his money and wait to die him. So the old man can’t go out even his room. The new neighbour woman knows in the first  that the old man died. Then  she can get his money and run away from others but they know her and race her. The woman plots with one of them and can run away together from them. After they have lottery money, They meet in a cafeteria and decide to married. I want to watch it again but i don’t remember the name of the movie."}
{"query_id": "239", "query": "Sad, Fantasy Movie – Young Boy in Burned Down House .\n I saw the movie in the early 90s, English language, and in color. I watched it on TV, but I believe it was a feature film. The ending involved a young boy, probably 8-10 years old, walking around a burnt out house. I think there were firefighters walking around in full gear, ignoring the boy. The house was burned enough that it was exposed to the outside. I don’t know if his family was dead or simply gone, but he was apparently left alone after returning from some adventure. I believe the whole movie had a somber, sad tone and may have been a  fantasy in line with the Jim Henson movies of that time period (Dark Crystal, Labyrinth, etc). Unfortunately I cannot remember anything else about the plot or characters. Any help is much appreciated. This has been bothering me for at least 15 years."}
{"query_id": "607", "query": "This one is a tough one !! .\n A man is kept hostage for some reason I believe it was for criminal purposes, he loves a woman and is cooperating  to keep her safe. Infact the woman and the man keeping the main character hostage are lovers and maybe brother and sister. I remember the hostage see’s them in a hot tub maybe kissing. This film may be anytime from the 90’s. I believe it to be American and I watched it over ten years ago! It was a crime themed film, sorry I cant be more help."}
{"query_id": "1079", "query": "Spy/Crime/Dectective Couple Drawing Tattoos on Each Other .\n I think this was a 60’s or 70’s foreign language film (possibly French or Italian) and in colour. There was a man and a woman who were either spies but more likely criminals or detectives – very glamorous. At various times in the film they would draw tattoos or pictures on each other (or it may have been just him drawing on her) The scene I remember the most is she receives a phone call while in bed. The call is from the man who is watching from down below, outside her window. Naked she moves to the window. He says something about her getting dressed. From the back you see her take the tattoo pencil and draw the straps of a dress onto her shoulders. Been bugging me for a while now so good luck…"}
{"query_id": "406", "query": "Female teleports to Earth from enlightened planet finds it strange .\n Late 80’s or early 90’s, possibly French movie about a female who teleports to Earth from a more enlightened planet finds it strange. On the other planet they live free from want or need, only needing to run jump & play. You see them on a grassy hillside joyful and talking but for some reason they decide to send someone to Earth. Not all of them can teleport so easily, but one or two out of three of them make it there. They find it very odd. I don’t remember what the plot was. I remember her being psychic. I remember her making three guys dance-walk franticly bouncing from side to side as they hear music."}
{"query_id": "614", "query": "young asian girl drops ring down sink, older white man takes apart sink to retrieve it .\n I think it’s a movie from the 80’s but could also have been from a tv show.  A couple of little girls (or possibly a family) are refugees from vietnam (or possibly elsewhere).  An american couple is helping them. A little girl drops a ring down a bathroom sink and freaks out and cries because it’s from her home/family.  The man helper takes apart the pipes and finds the ring.  I have been searching for this for years.  Any ideas would be much appreciated!"}
{"query_id": "707", "query": "Drowned boy, mystery solved years later .\n Google has failed me… Year – late 80s My grandparents were watching some movie or tv show after they thought I was asleep for the night. I must have stood in the hallway for a long time watching without them realizing. My grandparents were fairly “proper” people, so I expected this to be an episode of Masterpiece Mystery or Poirot, but I can’t find it. Anyway… In English, possibly black and white, maybe only black and white to signify flashback? An adult male – maybe priest? – drowns a young boy in a bathtub. The bathroom is not modern. Rough wood plank floors and a tub with feet. The scene involves watch sloshing over the edge of the tub. During the drowning, a necklace or rosary gets washed down the drain. I don’t know if this was a flashback or what but the next piece I remember is years later, somehow people find the necklace/rosary in the septic tank. Maybe the building burned down? Not sure. Thanks!!"}
{"query_id": "343", "query": "Old Horror/Gore Exploitation Film from late 60s/early 70s .\n I was probably three when my parents took me to a drive-in where they watched this bizarre film about several young women staying at some remote home. I remember a few scenes that stuck with me: One scene I remember one of the young women snuck into a room with a refrigerator and found the severed heads of her friends on the refrigerator shelves. Another scene I remember, the older woman that lived in the house was cooking something in a large soup pot and either her husband or son asked her what was cooking, opened up the lid of the pot and a human foot was floating in the soup. They both smiled like it was the most normal thing in the world. One of the end scenes was the last young woman winds up falling in love with the son of the cannibal family, and it’s the last survivor young woman in the kitchen making soup out of the parents, I think their heads were now in the fridge. If anyone can help me place this film it would be much appreciated."}
{"query_id": "474", "query": "Science fiction film with bizarre hermaphrodite alien prostitute. .\n I remember this really weird science fiction movie from the either 80’s or 90’s that I have not seen in over a decade. There was a scene where there was a character talking to this alien that looked like a fusion of a human male and female. When it spoke, it sounded like a man and a woman talking at the same time. It was in color and in English."}
{"query_id": "278", "query": "Pancake (Tortilla) on the Ceiling, Western, Black and White .\n Hi everyone! I remember watching this movie at a theater somewhat around 1976-79. Most likely it was in black and white and of a Western genre. The plot is not that different from the well known “Curly Sue”, “Alice in the Cities” or even “True Grit” and revolves around a journey of a middle-aged man and a little girl through the Wild West. I remember this man as a corpulent black-bearded cowboy taking care of a girl who was either his daughter or some orphaned child. All I recall is just this one scene: The man and the girl are making pancakes (or tortillas), and the man is showing the girl some sort of a trick – he throws the pancake up into the air, then catches it, then throws and catches it again. At some point, he throws the pancake and it disappears. Then both man and girl lift their eyes and see that the pancake is stuck to the ceiling. Several years ago, I’ve been told that this film is, perhaps, “The Paper Moon” by “Peter Bogdanovich… However, I rewatched it a few years back and never saw such a scene. Any help on identificating this movie is highly appreciated!"}
{"query_id": "113", "query": "Chimpanzees in France? .\n I watched this movie about ten years ago, but I’m pretty sure it was filmed before then.  It was something the teacher put on for us during a free day in elementary school.  The movie is based in France, somewhere in the countryside, but it is in English.  All I remember is that there’s a guy and a girl and one of them has two chimpanzees living with them and the other one is American.  I think they fall in love, but the chimps were a pretty significant part of the movie.  The only scene I remember clearly is the guy is walking down a dirt road, holding the chimpanzees’ hands."}
{"query_id": "139", "query": "Horror. House changes everytime someone dies. Maybe 1970s or 1980s, not really sure. Saw on TV… .\n Horror. House changes everytime someone dies. Maybe 1970s or 1980s, not really sure. Saw on TV pretty sure it was color. Seems like house was responsible for deaths."}
{"query_id": "1035", "query": "Wileddan .\n There’s a movie with a cult where the leader is trying to go into the after life then come back. I think it’s set in the seventies or eighties. The cult dies when they’re trying to kill them selves to complete their mission. Then years later these kids/people are nosing around and stubble on the cabins and are interested in what happened. Then one of the new people does and the old cult leader come back to life through that guy, and starts killing the rest of them and brings back the rest of the cult."}
{"query_id": "875", "query": "Young musician with a mechanical hands. .\n I saw the movie somewhere around 1986-88? on TV about young (high school) musician boy who played electronic music on a keyboard. Once he got injured in a car accident (or trapped in the car and hit with a fork lift) and lost both hands. With a help of his friends he got mechanical hands which could be programmed to type some sequence. With this and some practice he was able go back on scene and play on the concerts. He also had a mask, so he looked like a robot. I remember there was lots of nice electronic music, but what was the title of the movie? I cannot recall…"}
{"query_id": "1050", "query": "Some Fighting Movie?? .\n Well I remember watching this movie about 8 years ago in my dads house, it starts off with this guy who moves to this country (if I’m not mistaken, I think it was Somewhere in the U.K. Possibly Ireland) and he ends up joining this group of men in which all they do is fist fight with other groups.. A few details that I can recall was that almost every time they were about to fight another group, they would be singing this song. At the end of the movie, I remembered that the guy dies due to several punches to the face.. Pleeeease Help! Lol"}
{"query_id": "741", "query": "Kids enter singing competition. .\n I think this is a 90s movie, i saw it in 2004 on the TV. It’s an american family movie. The family don’t have a lot of money so the kids (a young girl, middle boy and oldest sister) seek out a rapper (i think) to help them win a singing/rapping competition so they could get money. They work with the rapper and practice really hard. In the end I think they come second in the competition, I can’t really remember. Thankyou."}
{"query_id": "996", "query": "Movie about teenagers who find stolen money .\n Four teenagers unknowingly find an injured bank robber in a parked car along this road near a gravel pit. They discover stolen money and dare one teen to shoot and kill the robber. They eventually wait for the robber to die but he doesn’t and then one teen kills the robber and they bury him in a park. They throw the gun in the trunk of the car and push the car into the gravel pit lake to hide it. Years later they meet up again as adults in a cabin. It turns out that the lake where the car is hidden is being drained so the authorities will find the car and possibly the gun in the trunk. Some of them want to turn the money in, the priest and lawyer, but one, who is a cop now, doesn’t want to. He likes his lifestyle with the stolen money. It ends in a hostage situation and eventually a shootout."}
{"query_id": "1007", "query": "Old Frankenstein style movie, maybe satiric? .\n Hello there! I saw this movie quite a while ago (10 years?) and here are the details I remember: – black and white, though I’m not sure if it was really old or made to look old – Frankenstein style scientist, who had “creations” running errands for him – those creations could be regenerated if he even had the smallest bodypart, for example a finger, that would be placed into a machine (I distinctly remember a metal spiral) and run through with electricity – I think I remember that the creations were kidnapping young women for the scientist to cast them in wax (I’m not sure, I could be mixing this up) – I also think those creations murdered at least a few people – underneath all the grimness, I remember the movie having a humorous undertone, which is why I think it could have been satirical – the whole movie had a little bit of a Frankenstein / the Munsters / the Addams family vibe to it. I’d be really grateful if someone remembers this ? Thx, Caramelia"}
{"query_id": "812", "query": "Girl lies to her mom and says she mixed red and white wine? .\n I randomly remembered this movie (or maybe an episode of a tv show) where a girl came home late/the next day from prom and her mom asked where she was and she lied and said she got drunk by mixing red and white wine. I think the real reason she didn’t come home was like, she met her real dad or something? For some reason I remember it as Julia Stiles but i looked at imdb and nothing on her filmology page rings any bells. Unfortunately I don’t remember much about the date."}
{"query_id": "613", "query": "Crime drama from the late 2000’s .\n It was about a guy who’s very intelligent and kills people. He eventually gets caught and goes to jail, but he manages to still kill people from there. At the end he gets killed with his own bomb thanks to one of the detectives. Any ideas?"}
{"query_id": "441", "query": "Guy walks through the rain in swim trunks at the end of this movie. .\n Another movie I saw on TV as a child during the 90s, in color and I’m assuming in English (the scene I watched didn’t have any actual speaking in it). I only caught it during the final scene. A guy is walking up a hill wearing nothing but swim trunks, from a beach if I remember correctly.  He seems distraught, and it begins to rain. At one point he passes by a tennis court and stares at it for a moment, sinister laughter echoing out as he looks. I think the laughter continues on in a couple other places he passes before he arrives at the steps of a house. While he tries to get the door open, the camera pans over to a broken window and goes inside – the room is dark and ransacked. Going back to the man who seemingly gives up and kneels down on the steps in defeat, the camera pans out and the credits begin to roll. The only other detail I remember is that it was playing dramatic/intense music during the scene."}
{"query_id": "692", "query": "Private investigator .\n This was definitely a TV series, maybe late 70’s or early 80’s. It was set in Singapore and was a about a private investigator, that’s how much I remember. I think the main character was an american and his helper was a local. The atmosphere was very dark and moist. Everybody was always sweating, at least that’s what I remember. Please help me locate this one. Thanks."}
{"query_id": "323", "query": "Metallic Plates, Alien Artifact(?), Fight on the Beach .\n The genre is sci-fi, action, adventure (but not that much of sci-fi actually). This movie was on TV in the early 80s, so most likely it’s from the 70s. It was a very simple, moderate budget movie without any special effects. It was in color, I think. A young man comes to a provincial seashore town having in his possession a piece of a metallic plate, decorated with strange symbols. As far as I recall they look like Phoenician alphabet. However, this is just a small piece of a bigger artifact, so this guy is looking for the rest of it. I really do not know why he comes to this particular town, most likely he has info that another piece is located somewhere around the area. Also there are other people looking for the same artifacts and they are in a competition. The movie is pivoting around this search and confrontation between the groups. So it’s mostly an action movie. I remember this scene at the very end of the film, this is how the movie ends. The protagonist and his opponent are fighting on the beach, the hero overcomes his enemy and a wave carries out the pieces of the artifact into the sea. The protagonist is walking sadly along the shore and suddenly finds both pieces thrown ashore by the wave. So he takes these two pieces and moves to some different location continuing his search. The end has this feel of the Incredible Hulk TV series. I remember asking my father about these metallic plates and their meaning. He said something like: These were parts of an artifact left by extraterrestrials who visited Earth in ancient times, the text on the plates revealed the date of their return. However, I’m not sure whether he was joking or not."}
{"query_id": "1042", "query": "French Movie 60s? .\n Hello, the movie I am looking for is, as far as I remember, a French movie / nouvelle vague / black & white. Probably 60s. The scene I remember is a boy running down a street at night with a cane in his hand, rattling it against a steel fence while running. I think you only see his feet and it was somehow a dream sequence. Finally he stops at a closed movie theater, he reaches with the cane through the closed steel gate and steals a movie poster. It might be Truffaut ? Anybody recognize this?"}
{"query_id": "178", "query": "Blowtorch Death by Mob. .\n I remember a scene in which a man, possibly Gene Hackman, is attacked in his home by a mob or group of men armed with a blowtorch. They hold him down on a four postered bed and burn his face, killing him.  It was gruesome. What was this film?"}
{"query_id": "355", "query": "King finds baby in the woods, but she’s actually evil and wants the thrown .\n I saw it when I was like 10, in 2004 or around there. It was on TV and I can’t tell you the original language because it was translated to Spanish. It was old, though, really old, but in color and I remember the beginning, when the king arrives to the castle with a baby in his arms and he tells his young daughter, who’s blonde, that the baby will be her sister and that he found her in the woods. The princess is excited, but when everyone leaves her alone with the baby, the baby does something (maybe bit her?) and the princess makes the baby turn over and the baby starts crying. The princess is scolded by everyone. Years later, when they’re both grown up, the princess is beautiful and fell in love? But her adopted sister who now has black hair, wants the kingdom for herself and puts like an enchantment or something on everyone so she can be hated and she can become queen. I don’t remember much more, only that the blonde princess goes into the woods and find this scarecrow (I think?) doll that used to be hers and he helps her defeat the girl who wants to take over. And the blonde princess has to fight against the prince she’s in love with for the ‘future queen’s hand’, but it’s actually to make him remember her or something.   I can’t remember anything else"}
{"query_id": "768", "query": "can someone please help me find the title of this scifi action movie? .\n there was this movie I watched when I was younger… -+ 10 years ago. it was an American movie about soldiers fighting humanlike robots (on an island I don’t know). I remember a scene where 1 guy got impaled by a wooden spear and the pain was too excruciating he ended up shooting himself. and this one scene where the last two survivors (man and woman) were kissing and all of a sudden they both got impaled by a wooden spear killing the dude but the woman survived due to the fact that she was hit in the shoulder. she successfully defeated the killerrobot and towards the end she fought this giant robot and ended up destroying it…. I cant find the title of this movie. can someone please help me?"}
{"query_id": "1088", "query": "Dark Wizard (Old) movie .\n Hi everyone, I have this dark wizard movie/ adventure to ask for the title. There was this dark wizard who was terrorising a whole small village I think it was. He was trying to get a little boy from them. I think in order to train him in the end. He held them hostages in a building. The main actor/ wizard was an old man with white hair. I can’t remember the actor or the rest of them. Or anything apart from this little plot that I already typed above. I would appreciate it if I had any answers on this one. Thank you in advance."}
{"query_id": "144", "query": "Animated movie, possibly Christmas movie, about boy and trains. .\n I remember watching this movie in the 90’s. I can remember the movie as being animated with typical cartoon human characters. I remember one of the first scenes as having a boy being chased by a steam locomotive pulling a train of passenger cars. The train chases him across a lake. The boy escapes to his home, then answers a knock at the door only to see that it is the train. He wakes up from the dream, picks up a toy locomotive and mutters, “Trains”. The film was, I believe, a Christmas type film and was a bit on the dark side as far as those films go. Maybe someone else has seen it?"}
{"query_id": "759", "query": "70’s sci-fi colour movie – member of group cuts off arm of another member to save his life because of… .\n 70’s sci-fi colour movie – member of group cuts off arm of another member to save his life because of blade tip is moving up his arm. Hi guys, I hope you can help me with this movie as it’s been stuck in my head for the last 30+ years. This is what I can remember; This is a sci-fi, I can’t remember where it is set or even if it’s on Earth, but there’s a group of people, maybe 6 or so. One of them is tough and has some sort of blades/knives as weapons. He can throw these and they come back to him – similar to a boomerang. One of the other members is a bit of a wimp (from memory). The wimpy guy takes/borrows one of these knives and I think he must throw it or something, anyway something happens and the tip of the knife sticks into his forearm. When the tough guy tries to pull the knife out, the tip breaks off and starts to travel up the wimpy guys arm. He decides to cut his arm off to save his life. That’s all I can remember. Except I think in another scene the knives are used to try and open a doorway to a cave or something. Any help would be appreciated Cheers, DrCarl."}
{"query_id": "401", "query": "Crime movie .\n I saw a movie a few years ago – color, english, crime/thriller/action genre… I remember it had something to do with a murder, but the main thing I remember is that there was a kid that hitched a ride with this guy who drove a big old car, and the entire interior of the car was pasted with porn. I think this guy wound up being like a major link to the killer, or possibly even the killer himself. I mainly want to find it, cause I was telling someone about it and they don’t believe me about the car."}
{"query_id": "688", "query": "Pretty girl ghost, wager, guy gets killed at the end by a gate .\n I remember a movie in the late 60’s maybe early 70’s about a guy who makes a bet that he can spend a night in a castle which has ghost.  He manages to survive with the help of a pretty girl ghost only to get killed at the end by a gate.  Does anybody know the title of this movie.  I may be wrong about the date, but I know I am close."}
{"query_id": "125", "query": "Movie about war with Native Americans .\n So this may be a tricky one. I remember having watched this film (highly possible that it was a miniseries) when I was a kid, I am 24 now and I believe I was under the age of 10 when I watched this. I remember watching it on the TV, it was in color, and the actors used English. Based on the graphics I would say that the feature came out sometime after 1980. Here are the snapshot scenes that I remember: A white woman (middle age) is shot in the knee by an arrow during an attack by Native Americans, she is then approached by a Native American who wraps some sort of beaded leather around her injured knee. Another scene: a woman desperately clings to and cries in agony as her dead baby is taken away in a carriage (maybe a sled). Another scene: a woman (think she was Asian) and a man (African American) are surrounded by a group of outlaws?, the outlaws stab the man ( I think he was stabbed in the armpit/rib area. The Asian woman is then hung by the outlaws, she was wearing a red dress. I also remember the woman who was shot in the knee living in a house with other women, one of whom has a baby. Woman with the baby considers shooting her child during the Native American attack to spare her child from capture or a more gruesome death. At another point, the slaves or servants (I don’t know if they were slaves but I do remember that they were African American) are hung by the Native Americans (though its possible that someone else hung the slaves. I really hope someone can help identify this movie/miniseries, I’ve read through dozens of descriptions of Westerns and nothing seems to quite fit. My mother, who also watched this, remembers the scenes I described but the not the name of the feature."}
{"query_id": "292", "query": "Alien plant .\n This was a definite made-for-tv, low-budget movie I saw on the Sci-Fi Channel a few years ago.   A demolition crew is in the process of tearing up an old military base when they come across a hidden room. In the middle of the room there is a tomb-like vault. When they remove the top of the vault they find it full of water and a drowned test monkey (or maybe a person) with a strange plant growth coming out of it’s chest. They take photos and the light from the camera flash starts the plant growing at a fast pace, killing everyone it touches. The survivors reason that if the plant is growing this fast at night, then it will be unstoppable once the sun rises. One person realizes that the plant is actively avoiding him and it turns out that this guy’s blood acts like Roundup to the plant so he has to find his way back to the vault and kill it at the source."}
{"query_id": "733", "query": "Shy awkward woman gets married .\n I watched this movie on the IFC channel sometime around 2004. The film was in english, but i think the actors had Scottish accents. The film is about a shy, awkward young woman who marries a man who works on a boat. I’m not sure if he was a fisherman. He is the only person that she opens up to. She is very shy and doesn’t really speak to anyone else. The man had blonde hair, and the woman had black hair. I remember a scene where everyone is drinking and dancing at their wedding and the woman brings her new husband to the bathroom and asks him to take her virginity there. He does and then after the wedding they have a part 2 of their wedding night. I can’t really remember, but i think either her husband eventually gets into an accident at sea while working and becomes disabled or dies."}
{"query_id": "116", "query": "help .\n I’m looking for an old black & white movie about a woman that visits a small town where she checks into an Inn. There is a trap door in the floor of her room at the inn. There is a run down old church on the town square. Also, there is an antique shop where the visiting lady borrows an old book. Some of the towns people are evil but the old preacher in the church is not. I think the lady that runs the antiques shop is the daughter of the old preacher. The movie set is very simple but very creepy. The towns people are equally as creepy. I think the evil towns people meet once a year"}
{"query_id": "975", "query": "VHS 80s/90s kids show or movie .\n Husband was about 10 or 9 when he saw some Kids show or movie on VHS (’95 or ’96) at his Grandma’s house. It was in color and animated. “It was in English.  The movie was about two opposing groups in a home computer tower. They fought each other there all the time. But in the movie there is a power surge to the computer and opens a portal for the bad computer programs to escape to our world. Now for the programs to get around they would fly around on what looked like microchips. But in the human world they transformed human items into new ships. One ship was a flashlight, another was an alarm clock. They continue their fight in our world until the good guys round up all the bad ones and bring them back to the computer world.”"}
{"query_id": "629", "query": "1980’s Movie .\n the approximate date you saw it, – I dont recall mid to late 80’s whether it was in English or another language – English whether you saw it on TV (it might be a TV episode rather than a movie) – I remember seeing it on KTLA movie night (channel 5 in L.A. area). whether it was in color or black and white – Color anything else you can think of that might help pinpoint the film. – unknown  I dont remember the  whole movie only parts. Things that could be Key would be the house/setting was a desert home i believe in Arizona. I remember seeing some kind of pyramid shaped portal or door close to or even in the bayrad of the house. another thing i recall seeing in the movie was small ufo’s flying through the house.  "}
{"query_id": "751", "query": "Two kids and a troll hunt crystals .\n My friend has memories of this tv show he used to watch and have copies of on vhs but he can’t remember what the show was. He says it was an English speaking show airing around the same time as first generation Power Rangers, and the plot is about a boy meeting a scientist and helping him locate strange crystals. Together with the help of a warrior girl and a troll who’s hair glows when a crystal is near they travel in their ship across various dimensions in search of these things, and with all sorts of other adventures along the way. the last episode, to the best of my friends recollection, involves the cast’s ship being damaged and then forced to combine the crystals to transport themselves to a new location where another crystal is near. There the warrior girl bites a mushroom that turns out to be a living race and gets poisoned, and the boy goes off to search for a cure. I’m at a loss myself, but has anyone else heard of this show and can provide any more information? It would be appreciated."}
{"query_id": "555", "query": "3 girls stripping for a bunch of musician guys .\n I saw this clip on dailymotion. It seems to have been deleted now as I can’t find it. It was a color video. There is a half nude Arabian girl dancing around 5 men sitting on the floor, 3 of whom are playing instruments. There are two guest girls too who are also sitting and watching the dance. One of the girl hints the other girl about the dance. The other girl then stands up and starts stripping while dancing and gets full nude. The men also stand up and start clapping to encourage. The first guest girl also joins and starts stripping and dancing and gets full nude. Towards the end of the clip the music dies and the men form a canopy with their long robes and cover all the three girls. Can anyone help to identify the name of the movie?"}
{"query_id": "1093", "query": "Seen on youtube free movies – sci-fi – man gives birth .\n Watched this movie on youtube’s free movies around 2012. It was low budget either a B movie or a very similar . Plot – A man who i think was a doctor (worked in a lab) was exposed to some foreign mass i think a meteor or similar and a growth started to develop on him. Turns out this is a parasite and he eventually gives birth to a creature with several limbs. The creature is taken away, but the man fights for the right for it to be released under some sort of human rights or parental rights – I believe the main point of the movie was to discuss the rights of a child (or lack of) if it was not technically a human (half human/half alien) – I think the title of the movie was a word that defined this but I cannot remember it at all. There is a court case where the creature is in fact released into the control of the man (father). Thanks."}
{"query_id": "829", "query": "Family of orphan children .\n I saw the movie in the early 60’s on TV. It was in English. I think it was in black and white. If I remember right it was set at christmas time. There are about 5 children. When the parents die the oldest child takes the sibling around finding homes for them. I’m pretty sure trying to find homes for them all before christmas. I think there was snow. Earlier in the movie one of the children was afraid of something and said “I’m a feared , I’m a feared” i remember that because we used to say it all the time after watching this movie:)"}
{"query_id": "952", "query": "Thriller about kidnapped kids .\n The movie I am looking for is from the 80’s. A women’s two children (son and daughter) are kidnapped by her ex-husband, that she thought was dead, while playing on their swing in the yard (mom is in the shower). She had two children with the ex that he killed and she was accused of the crime. Some people think that she killed the two that are missing now. The ex has them in a large house, that one of the women’s friends have rented to him. She finds the children after her friend gives her a glove that her daughter was wearing the morning she went missing. They fight on a catwalk at the house, at the end of the movie and he falls to his death. In color, set in New England I think."}
{"query_id": "396", "query": "Horror movie / a lady’s hair moves? .\n So, I caught part of a horror movie on television years ago and have been trying to find out what it was ever since, but unfortunately I don’t have much to go on. The only scene I remember is of a woman with dark hair sitting in front of a mirror, and she saw her hair move by itself in a really noticeable way–I think there was a ghost? I’m also pretty certain (but not 100%) the room she was in was rather red, I’m not sure if it was the lighting or the actual room. I don’t know when the movie was made but I saw it more than 5 years ago. Is this scene familiar to anyone?"}
{"query_id": "291", "query": "Man hides thoughts in secret subconscious .\n Please help me figure this out! It’s been driving me crazy for months. It’s a movie I watched within the past 10-15 years. The only part I remember is the main character (a man who was possibly a writer) was trying to hide his thoughts or memories from a bad guy in a fictional library (?) inside his mind? I remember him running around a circular room pushing files that were his thoughts or memories and trying to lock doors before the bad guy could in to his subconscious. It seems like there was a woman there helping him. That’s all I can remember! I know it’s very vague and I could be a little off on some of the story line, but I’m hoping someone remembers! Thanks!"}
{"query_id": "372", "query": "Late 80’s early 90’s horror film. .\n The movie starts out with an American family who are staying in some East European Castle with their young son. He’s like maybe 9 or 10. I think it was in Czechoslovakia, maybe Romania. It’s night time and the boy is running around trying to escape some thing that is chasing him throughout the castle and you can hear his parents screaming. He manages to escape the castle, but his parents are killed by whatever was chasing him. Years later he comes back with his girlfriend or fiancee and their going to stay at the same castle. Little by little, his behavior becomes eratic as he is slowly being possessed by whatever force lives in the castle. Eventually, he starts chasing his girl and is trying to kill her. She eventually makes it down to some hidden area where the mummified remains of some prince is sitting on a throne. Suddenly, the prince gets up and starts shambling towards her. He’s moving really slow since it’s all practical effects. Turns out he’s the one who has been possessing the guy. The prince was young when he died, I think, and wanted the kid to stay with him. That’s why he got rid of the guys parents. So, she’s being chased by both of them. In the end, she manages to get away and I think she ends up killing her boyfriend in order to escape. Then, the prince sits back on his throne and whispers “Stay,” over and over before it fades to black and the credits roll. Hopefully, someone here has seen it. I honestly think I only saw it the one time, but that mummy prince starting to move freaked me out when I saw it as a kid!"}
{"query_id": "944", "query": "movie where mother tries to smother small child in hotel room .\n older movie about a family moving or on the go, not sure, and they are in a hotel room  or in a room not sure and the small child is crying I think and the mother puts a pillow over their face, but then changes her mind?"}
{"query_id": "805", "query": "weird film about time traveller\\Alien who travels to medieval Europe .\n Hello,   Can anyone recognize this film? I saw it on middle 90´s on TV and it was a very grisly film about a guy (I remember he was long haired and maybe gray hair) from the future/alien who went to Medieval Europe to investigate something; He constantly returned to his ship to talk with someone on a screen. I remember it was very grisly with some gore in it. In the end, the bad guy kills someone close to the hero, which pisses him off a lot, and run to his ship to get some futuristic gun to kill the bad guy."}
{"query_id": "225", "query": "Horror Film, late 90s or early 00s? .\n There’s this movie that played on  AMC a while back and the movie was about a woman who kept seeing a strange man follow her on a subway/train and I think she’s the only one who saw him. His house had yellow , dirty walls, dirty house and there was a jar on bloody tongues on a small desk with a pair of pliers next to it. The man had white hair I think. The woman went to go tell a man or something what’s been happening and his room was blue with lights. That’s all I remember, please help me find this movie name!!! It’s bugging me"}
{"query_id": "764", "query": "A family TV-series/Movie cut into several episodes simillar to 10th Kingdom .\n Watched it either in the end of 90’s or the beginning of 2000’s. It has the same structure as 10th Kingdom as it’s a series with not so many episodes. The plot goes: Wizards or sages from another world(medieval china iirc) summon a family(a girl and her dad) from our world(in a car) and a witch from a third party world to save their world from evil robots who turn out to be automative APC’s(multiwheeled armored vehicles armed with lasers). The Witch betrays them for her own goals. Robots use drills(someone hides underground in the tunnels/caves) and satelite like antenas to locate the heroes. At one point girl confronts a robot dressed in armor literally made of mirrors(to reflects lasers). She’s shot and knocked unconscious but is alive. Her dad storms a yard in a car(yellow jeep iirc) and the guards can’t stop him until he runs out of gas or the car malfunctions. The Witch uses a craft to travel via teleportation simillar to a small boat with two rows of seats facing each other and a spinning thing in the middle of it."}
{"query_id": "967", "query": "Crazy Car Cage Killer Movie? .\n A friend is asking me, but it’s not my genre. Anyone?   “Hey do you recall a movie from 90’s maybe late 80’s where dude makes a plastic cage in the passenger side of his car and puts girls in there and drives real crazy making them slam into the dash or the cage killing them??”"}
{"query_id": "218", "query": "Nature and eco-catastrophe themes, B quality movie .\n The movie is about a boy who lives in a post-ecological catastrophe world, where the sun is really intense and anyone spending time outside gets burned. I remember the boy being a (kick?)boxer at the school gym, some parts of the movie are about him getting bullied by the competition, at some point they tie him up in the sun and he barely survives. He dates a girl from school, but I don’t really remember anything else about that. His father is some sort of insane scientist who is looking for a solution to the sun problem, and progressively turns his house into a swamp/jungle and himself /the father) into a plant monster, who ends up attacking the bullies when they follow the boy home. In the end the boy and the girl are immune to the sun. I think I watched the movie on TV in the late 90s or the really early 2000s, and it had a B quality feel to it. I already searched by keywords on most sites that offer movie identification, but found nothing. I expected the title to be “Green” or “Growth” or “Spore” or something in that vein, and there are movies with those titles on IMDB, but none of those is the right one. Thanks to anyone who can help! Miki"}
{"query_id": "795", "query": "Live action movie with female lead, sci-fi .\n I watched this movie a long time ago, when I was a kid (it was far from a kid’s movie) around 2007, so details may be partially incorrect. The movie was likely created around this time. I don’t recall the exact premise, the woman seemed to be a former human test subject on the run. I recall a scene where the main character is having a nightmare. In the dream, the woman is curled up inside a blue bubble-shaped container filled with water or other clear liquid. She is unconscious, eyes closed with an oxygen mask on her face. Black tubes/wires surround the bubble. A scientist in a white lab coat is walking around the bubble, examining her."}
{"query_id": "796", "query": "KID THAT IS TRYING TO FIND PARENTS .\n alright, i saw this movie once on a tv program that was airing old movies at night. i remember that it had this little kid that was searching for his parents but he was traveling through i think space or the earth but in a kinda apocalyptic atmosphere. i knew it was kinda old by the way it looked.  the antagonist i think followed him around and appears before the protagonist several times. it was either sci fi or apocalyptic. he was blonde and kinda short. i know this is kinda vague but pls help."}
{"query_id": "669", "query": "House Hostage Movie .\n Movie where a nuclear family was held hostage in their house I remembered two scenes from the movie:   1st scene:the teenage daughter went to the door and her boyfriend was at the door and she told him to go away and then he came back with flowers and  one of the persons holding them hostage told  her to go with her boyfriend, she went out, then her boyfriend said “I don’t know what’s going on here but let’s get out of here” and drove away.   2nd scene: when it almost finished the man holding them hostage was going to shoot the man but there was no bullet in the gun, then the man held him and pushed him outside or something like that ( there was about four persons holding them hostage, I think a woman was in it too, it’s not firewall )"}
{"query_id": "894", "query": "1990s suspense/thriller/romance/psycho film .\n The movie is something I saw sometime 1996-1997 on cable tv. The movie is about a teenage girl who paints or studies fine arts and lives by herself. She is a bit sexual. She then begins to have an affair with her older and married arts/painting instructor/teacher which sees her and paints her in the nude afterwhich they have sex… It was surely an english movie and colored. There were also scenes like an asian boardmate that played the cello and a scene where the girl and the teacher make out or something in the kitchen while the teacher hosts a friendly dinner at his house for the girl."}
{"query_id": "653", "query": "Woman tries to steal jewel from old man and she has different disguises. .\n It is in color, and is a children’s movie. She finally confronts him with a gun at a ski trip, and he wears a fake tattoo to hide from her. But it washes off in a jacuzzi. lor, and is a children’s movie. She finally confronts him with a gun at a ski trip, and he wears a fake tattoo to hide from her. But it washes off in a jacuzzi."}
{"query_id": "986", "query": "Old TV movie .\n Saw early 70s. On TV. young couple returns to her old home. Find her crazy sister (maybe twin) chained in the attic."}
{"query_id": "866", "query": "Late 80s/90s movie .\n There’s a movie that I watch as a child, late 80s, probably 90s. It was on TV, we recorded it on a VHS to watch. I think it was a kids halloween movie. There were 2 kids (brother and sister possibly) And the water mill in their town was running dry. I can’t remember the adventure, but I remember the boy at the end, making a wish and skipping a rock into the dried up part where the mill was, and it magically skipped 3 times and apparently that meant his wish would come true and water appeared in the mill once again. Please help. This has been driving my crazy! Thanks!"}
{"query_id": "496", "query": "Science fiction/horror movie with teleporting undertaker. .\n I vaguely remember a scene from a movie or weekly show like The Night Gallery or Twilight Zone that had a guy, I remember him as tall and gaunt, dressed in old, formal clothes like an undertaker and he was teleporting around on an invisible grid. The landscape seemed bleak, perhaps a desert. That’s about all that I can remember-does this sound familiar to anyone? Thanks for the help."}
{"query_id": "394", "query": "around 2000, depressing and subtle drama of multiple stories. Believe it is canadian but not sure. .\n I have not seen it for about 10 years, dont know any actors.. Movie covers few intertwined stories in kinda cold and depressing atmosphere. One of them is about a girl who works as maid, and she was involved in a traffic accident and recovers afterwards. The man she working for thought that she stole his watch as he couldnt find it, but it was in a drawer at his home. Another story portrays man going through divorce, and waves at some woman in another subway train at the end of the movie. Another bit i remember is man who has addict son and pays bail for him. Student asks his physics professor for better grade as he wants to study medicine but doesnt get it, and commits suicide(other students speculate it). Always happy fatty gets fired, but his ex-collegue finds him a new job which he is again happy with. One of their collegues wins a lottery and quits. Just very touching an subtle movie(as far as I remember) thank"}
{"query_id": "352", "query": "90s film with Highschool or College kids girl eats part of something she was dissecting in class .\n I saw a part of a movie around the early 90s ( was definitely filmed around then as well or maybe even late 80s and was in english ). I vaguely remember a girl with short hair eating part of something in class that was being dissected to gross out a blonde snobby girl who vomited upon seeing this. Any help solving this would be much appreciated. Thanks ahead of time!"}
{"query_id": "604", "query": "Alien living here .\n SO, I remember a B&W movie I saw on TV in the 60’s where an alien spacecraft lands (maybe ‘crashes’ is better) in the desert near a small town.  The humanoid alien befriends (or is befriended by) a woman in town and they talk in her home.  People start getting killed on the outskirts of town, because some kind of alien creature had gotten aboard the craft, and the creature is hiding in a cave outside town.   When he hears of these killings, the humanoid alien recognizes that these are due to this creature, and he goes to try to kill it.  His hand weapon has been damaged (perhaps by the crash) and won’t work.  He disassembles it on her kitchen table, and finds a part that’s damaged.  He decides that the wires on poles running around town have power that might be able to operate his weapon to kill the creature.   The woman takes him out to the road near the cave, he climbs a telephone pole, cuts the wires and hooks them to his weapon.  She got on a nearby telephone, calls the local power company, where the guy at the power plant switches off the power as the alien is cutting the wires and connecting them to his weapon, and then turns the power back on, at her request over the phone. That’s what I remember, anyway… What’s the name of it?"}
{"query_id": "601", "query": "Late 90s Teen Movie .\n Okay, I know; dime a dozen. And theres not a ton of differentiation. I watched it probably in 2001-2004 maybe? In color and in English, and it was definitely on VHS. The opening credits were scanning a bunch of makeup pallets and lipsticks and stuff. Now, I’m sort of trying to fill in the blanks here so forgive me, but I believe the main character is an “Average Joe” of sorts and is in love with the popular girl. They somehow end up spending time together. Theres a scene that I vaguely remember where I believe she jokingly invites him to shower with her and she goes ahead and he quietly sneaks into the bathroom and opens op the curtain but when she notices she screams at him to get out and she wasn’t serious. She forgives him and they sort of carry on with the evening. Then she becomes oddly obsessed with him (or obsessed with him rejecting her in the end). I’m not sure what happens here but she ends up (I think drunkenly) sitting in a lawn chair in his front yard screaming at him to go to prom with her."}
{"query_id": "562", "query": "Boy shoots boy by accident movie/tv show .\n Two kids (both boys) are seen playing in a bedroom and with a gun that one of the kids found (I believe in that room).  The boy shoots him (who he was friends with) accidentally and it ends up killing him. I remember the boy that was shot falling into the closet and just laying there. After, police end up coming and I believe they start questioning the kid. Both the kids were young, I say early teens if not younger. I’m really not sure whether it was a movie or part of a tv show."}
{"query_id": "730", "query": "Sci-fi Dune style movie with worm monster and sand, but not Dune. .\n I’m trying for many years to find the title of this movie, which I watched on tv during my childhood (1980’s). I first assumed it was Dune, but was never able to find such scene in it. It’s a sci-fi / fantasy type of movie, set in a desert-like place. A lot of dunes, wind, etc. It remember it having an old feel for the time, so maybe from the end of the 1970’s? The scene I remember involves a worm type monster (hence the Dune thoughts) that lived in a hole surrounded by the dunes. The main characters/heroes had to be careful not be dragged by this worm (tentacles?) back to its hole/den. This happens with one of the main characters, and I never forgot him being dragged screaming by the foot to the hole in the sand. The worm, or tentacle, was not large but long, more like a snake. I also seem to remember it being in the future, or maybe the characters had suits/astronaut gear. Thanks! ?"}
{"query_id": "600", "query": "This Alien-Like Movie from the 90’s .\n I remember a scene from an “independence day”-like film. Only one scene really stands out and its where a human and an alien are in the process of shaking hands (a truce of sorts)… but the alien is deceiving the human… then the aliens hand turns into a worm type thing and kills the human."}
{"query_id": "657", "query": "Strange film, sci-fi/fantasy, “mailbox” film .\n I was born in 81 and I saw this film as a kid as a video rental. It had a modern family but they went on some sort of magical adventure. I remember several key things that would identify it. There was a focus on a mailbox or something in the mailbox that caused magical things. There was a desert with bones in it. There was a glass wall, like an invisible wall. I’ve already done a lot of web searches, it’s probably not an obvious or common movie."}
{"query_id": "956", "query": "90s movie: Guy always ordering rum and coke .\n I think this movie came out in the 90s. It is in English and color. It had something to do with a childhood friend of this guy gets invited to his party. The guy is really awkward and doesn’t fit in with the in-crowd. He is always ordering rum and cokes. His friend that invites him is successful and engaged I think. Towards the end of the movie the two guys end up having sex I think."}
{"query_id": "109", "query": "Zombies created from rain of burnt green alien .\n This is an old movie. As far as I remember, the plot was the following: Some guys stole/found a truck from a military convoy that turns out it had an alien inside. The alien was done by a guy in a bright green suit, kind of silly looking. They decided to kill the alien, by cutting him in parts and burning them in the crematorium. I think, when they cut his hand and other limbs they noticed they remained moving, so it couldn’t be killed. They burnt the body. After which, the smoke from the fire went in the atmosphere, turned into a cloud and rained down over the cemetery. Which of course lead to infecting the dead bodies and they becoming zombies. I think the movie ended as the government nuked the town. Saw this movie a few years back, it looked like 50s – 60s movie. It was in color. I watched it on the MGM channel, so I suspect it is MGM movie. The movie was in English language."}
{"query_id": "801", "query": "movie where there is a realtor trying to sell a house to a couple .\n I just remember that the realtor is telling the couple horror stories of the houses he is trying to sell. In one of the houses I believe there was a little girl that had a monkey that ended up killing her family. Upon hearing the story the couple decide they don’t want the house, the realtor shows them another house and the couple love it. Its a big house with a pool, but the husband asks why its so cheap and so the realtor tells him the story. A young guy lived there with his parents who were ever there and the young guy started having visions of a killer that wore a grandma mask when he killed his victims. Those visions became true and he finally went to a therapist i guess to talk about it. In the end he tells the therapist that he is actually there because he had a vision she was gonna get killed. Therapist gets scared, runs off and gets killed by the grandma killer. I think the kid gets killed as well. After the realtor finishes the story the couple refuse to look at any other houses and the realtor gets desperate and stabs the husband on the neck with the house key. The wife runs and tries to get a neighbor to help but she realizes that the whole neighborhood is messed up. I haven’t found this movie and I really wanna know what it is. I think I saw it in the early 2000’s? Maybe mid 2000’s?"}
{"query_id": "495", "query": "6-Film live action fantasy series crystal collectors? .\n Movie series spanned across 6 VHS tapes that I would rent at a Video Connection while growing up. In color, in English, rented films, don’t remember if ever on TV, had to have been released very late 80s but possibly up to mid 90s, I believe I would have watched between 1995-98. I remember the 2nd film having like a large alien race with bald/possibly Conehead resemblances that captured the main protagonist. I can’t remember if he traveled via spaceship or what. But those large aliens in movie 2 put him in a large terrarium type of setting like what a tarantula would be in, but I don’t remember if there were any threats like spiders, snakes etc. Film 3 brought the protagonist to a town and I swear one of the characters in the third film was basically a real-life raggedy Anne doll or something. There were other helpers in this town; a convention or type of fall festival was ongoing while the guy visited in search of the crystal or whatever it was he was looking for. Can’t remember films 1, 4, or 6 for the life of me, but I remember that at the end of film 4 there was a preview for the 5th one that included their spaceship or perhaps a subway train or something being attacked by like brown worm like monsters which was going to stop or crash what the protagonist was riding in. I feel like at the beginning of the series he may have been in his room on a computer and brought aboard a spaceship to begin the adventure. He may be brown/darker haired and have a new partner or group of folks tagging along eacf film or a new partner coming on board for the remainder of the adventure. I’m thinking he wasn’t alone. I can’t remember completely but I believe the 2nd film had a yellow vhs box showing large hands reaching into the terrarium, and movie 3 may have been bright pink as the box with the raggtedy Anne character on the cover with the main character and a few others. The ultimate questbor goal was to reunite their crystal shards or collecting so many pieces of a shiny substance. I don’t think they traveled through time, though it is possible. I never got to watch or find out how the series ended because the video rental store never acquired a copy to my knowledge. Please help me as I’ve struggled remembering this from my childhood since I originally watched them back then. Thanks in advance!"}
{"query_id": "823", "query": "Barbie-esq movie from 80s or 90s .\n I remember watching this cartoon as a kid, and I’m pretty sure I had it on VHS. It kind of had a Barbie vibe, only the main character was a brunette. I think it was a few short movies in one. I remember one story was about the lady baby sitting a baby, and another where her and her friends went to the mall. Unfortunately I don’t remember much other then that, but I have been trying to figure it out for a while now."}
{"query_id": "1025", "query": "Older movie in color, shooting scene then forced to travel thru a desert .\n So the first thing I remember is they were having a get together/ party outdoors and someone mistakenly puts wet cat food on the table and someone eats it with a cracker. Next thing I remember is a shooting scene, most people at the home are killed and I remember a younger person hiding and seeing all the blood shed but is unharmed. Then they are forced to travel through a desert? I believe it was a young girl and a boy traveling, at one point they dig in the sand and are able to find water and then at some point the come upon a cave. The end of the movie is them finally being rescued or finally crossing the desert. Please help I think about this movie all the time it’s been driving me crazy for years!"}
{"query_id": "445", "query": "Girl In a Coma .\n For the longest time I’ve searched to find the title for this movie but have had no success. The movie begins with a brother and sister walking to school. They cross the road which is all cobblestone so I’m assuming it’s a European movie. As they cross the road, the girl gets hit by a car and put into a coma. The family tries everything to wake her but they have no success. They finally find a doctor who says he can put the brother into a coma to rescue her and bring her back so he connects their brain waves through wires or something. The brother finds his sister at a cabin. She is on the pond playing and she slips through the ice. Her brother runs to save her and can bring her out of the water. This wakes her from the coma. I believe the girls name is possibly Frankie. I’m not too sure though. I saw this movie before 2010 but after 2000. It was on tv. It was in color, but very dark. Please try to find it! Hopefully someone else remembers this. My mom remembers but can’t remember the name of it either :/"}
{"query_id": "259", "query": "Low budget horror movie-scarred girl, group holds victims hostage .\n i remember this film quite well, just not the title. its about a group of high school students who are constantly bullied. at one point the bullies corner 2 guys in the bathroom and break one of their cameras. so they all retaliate by throwing a party, in disguise, and knocking them all out with chemicals in the punch. they all wake up chained up. the main characters are in disguise. the main one has a trench coat and gas mask, a girl has a butterfly mask. and a black kid has a clown suit. at one point the black kid wants to opt out so gas mask guy stabs him and he dies. the way they torture their victims include: making a fat guy chop off a girl’s fingers, using a nail shooter thing (like in no country for old men) on a guy’s leg and face, and putting a slowly working acid on a girl’s face. eventually one of them escapes (a black jock i think) and tries to get help. the cop he finds gets killed and there is a quad chase. when they are found by the cops they kill themselves. the girl they put acid on is seen in a coffee shop, scarred, in the intro and conclusion of the film. her scenes are in black and white. thanks in advance"}
{"query_id": "330", "query": "Two shy teens cluelessly try to have sex / handjob for the first time (SFW) .\n Film Production Date: Unknown Film is in: Color Setting: Probably pre-Internet Actors: VERY MAYBE Sarah Michelle Gellar and Matthew Broderick, both quite young (teens) I have seen only one scene of this movie (or TV series episode?) that circulated the net as animated GIF with (yellow/white? subtitles), maybe on imgur.com or a similar site. The scene goes like this:  A young girl and a young boy (both 12-16, I’d guess), both half-dressed, seemingly a bit shy and totally clueless about sex, try to have either sex or perform a handjob on the boy. They stand in a simply furnished room with (IIRC) not much more than a bed, a chair and maybe a table.   They alternately make suggestions (more like guesses) how to go about it. When the boy makes a suggestion, he repeatedly refers to horses (“like I’ve seen horses do”, something along those lines).   One of the suggestions is that the girl should stand on a chair.   At one point, the girl tells the boy to stop making references to horses.   At one point, the girl removes her bra (no nudity is shown, thanks to the camera perspective / clipping).   At the end of the scene, the girl is seen having her hands near/in the boy’s genital area and remarking something like “oh, only so little (liquid)?”.  The girl had a “smiling dimple” that reminded me of Sarah Michelle Gellar, but I’m absolutely unsure. Even more so with Matthew Broderick. Any help appreciated!"}
{"query_id": "213", "query": "Skinny Crucifix Obsessed Jeweler .\n This movie was about a goldsmith who is starving his female muse so she might be the embodiment of Christ for the skinny crucifixes he’s obsessed with making. I first saw it on Netflix in around 2011."}
{"query_id": "595", "query": "Weird 80’s Beta Max movie .\n Ok. My dad had this movie when I was a kid in the 80’s.  It’s set in the future (like the 2000s)  It’s also really colorful,  live action.  There is this family that I believe lives under ground.  I remember weird food comes through hoses or pipes.  The food is either slimy or colorful and I think the family may be mutated.  I think the name is like the weird something or the freaky something.  But I haven’t seen it since the late 80’s early 90’s."}
{"query_id": "384", "query": "Thriller movie with cult .\n i have seen this movie around a decade or two. It is colored. It is in english language. The plot is: the man (i forgot if it is a priest or a police… or neither) is investigating a cult slash village because there is something fishy about the town. The kids (might include teenagers) are missing. And it is because they are being collected by the mysterious cult. The nice thing about this movie is that the kids that are being collected should be physically beautiful (dont get me wrong what beautiful means, i just want to remember this movie). They are being collected because satan is coming back to earth beautifully. The scene i remember: the child is riding a horse in her nightgown and or with or without the man who is investigating. I think she was trying to seduce him if he was there with her on the horse. There is another scene that one of them, the child or the man is being dragged by the horse alone. Noone is on top of the horse. But it is sort of controlled by the cult using powers. Some of the kids are found but they are all kind of asleep or their faces are all cut off. The kid is the last one already for the preparation of the coming of satan here on earth to be beautiful. The dialogue i remember was: satan is coming back to earth beautiful. May not be exact. Ending: i think the cult didn’t succeed. You can say it was a happy ending for a thriller/horror movie. Or i could be wrong. Pls help me find the title. Ive been thinking about this for months already. ?"}
{"query_id": "122", "query": "Little white people underground cave .\n I remember a movie I think I saw in the 90s on channel Fox 5.  I think the movie was from the 80s. It was in English and in color.  I remember some humans go into an underground cave.  In the cave these little white creatures that have human face come out.  I think the face color was either green or red.  I think they were like oompa loompas from chocolate factory.  Also I remember at the end there was an unexpected ending.  The main character I think gets shot and killed.  I remember it was on a bus. Please help me find this movie!"}
{"query_id": "828", "query": "Animated Movie (consisted of several short movies) That Was Once On Netflix .\n I remember watching an animated movie in the years 2009-2015. I don’t remember the name or any of the actors of the movie, but I remember a lot about it. First off, it was animated. It wasn’t super high quality, the people/things looked like silhouettes (you couldn’t see their faces or exact clothing details, but you could see the shadows of them). Second, it was about a boy and a girl acting out these “plays” in an old theater owned by an old man, who may have been their grandfather. There was also an owl in the theater, and it looked at the camera and hooted whenever they changed from one “play” to another. Third, to change from one costume to another, they stood on a sort of platform thing. It “scanned” them, and the silhouettes of the clothes they described appeared on their bodies. The plays/plots I remember are as follows : Boy gets put in prison (wrongly accused of stealing a necklace, I think), but gets pitied by a princess and she takes him food/clothing. However, the good princess’s evil sister tries to marry the boy when he gets out of prison. When he refuses/realizes she’s the evil princess, she curses him to be a wolf. Boy then eventually gets freed by the good princess. Boy finds himself in a city of gold, but an evil dragon rules the city. The dragon gives the people gold, but only if they sacrifice the most beautiful maiden to the dragon every month/year. Boy eventually slays dragon and marries the girl, who was the most beautiful at that time. Boy is in Africa/similar place and likes to play the drum, but is shunned for doing so. The girl’s father is the clan/tribe chief and is dying from illness. Boy gets thrown out of clan/tribe, but saves an old medicine man from a leopard/big cat. Old medicine man teaches boy how to play drum, which ends up healing the sick clan/tribe chief. The drum also makes the clan/tribe unbeatable in battle. Boy is an adventurer in a strange land where he crawls through a tunnel and gets put in prison. He has to choose/marry one of the king’s three daughters, but he doesn’t know which one. A bee flies around the head of the correct daughter because he fed the bee earlier in the tunnel. He also gets help from other monsters he met in the tunnel/cave. There may have been more, but it’s been years since I saw the movie. It was"}
